[
    {
        "sign": "cancer",
        "compatability": "Water(Cancer)-Earth(Capricorn) connection. Cancer and Capricorn sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract! Your differences can serve to complement each other if you really understand and appreciate each other. A Cancer and Capricorn friendship is quite strong and balanced. Capricorns like to plan things out and Cancers aren’t too picky when it comes to activities. Compromise is easy for them. They will create a secure, lifelong bond. These signs will be able to tell one another anything. They won’t judge each other. These signs will support each other through everything. \n Water(Cancer)-Earth(Virgo) connection. A partnership between a Cancer and a Virgo is a plain and simple, yet powerful, relationship that gets better and better over time. Cancer and Virgo are well disciplined and strive to attain their objectives. They are earnest and dedicated to their friendship, and appreciate each other a lot. Virgo admires Cancer’s quiet yet immense strength, and Cancer admires Virgo’s flexibility. Cancer and Virgo individuals are both incredibly loyal, so they will also always have each others' back. Together, these individuals make the perfect team. \n Water(Cancer)-Water(Scorpio) connection. A partnership between a Cancer and a Scorpio involves a meeting of two people with good depth of character. The two signs complement each other wonderfully, with either one’s strong points balancing the other’s weak points, and vice versa. Cancer and Scorpio feel a natural attraction towards each other, and form an unusually close bond, especially when their desires and ends correspond well. And even further, Cancer and Scorpio are very similar to each other."
    },
    {
        "sign": "libra",
        "compatability": "Air(Libra)-Fire(Aries) connection. Libra and Aries sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract! While these two signs have opposing rulers, they actually have complementary elements. Fire and air signs tend to do really well together, since fire needs air in order to survive. This makes both Aries and Libra the life of the party — Libra's the one throwing it, of course, and Aries is the star of the show. \n Air(Libra)-Fire(Leo) connection. The star signs comprehend each other well and communicate wonderfully with each other. Leo’s vivacity of character and Libra’s eagerness for peace create an amazing partnership. Leo is dynamic and flaunting, and Libra is sophisticated and diplomatic. Both signs could admire each other’s qualities, and profit from each other; and they maintain a harmonious relationship. \n Air(Libra)-Fire(Gemini) connection. You have an excellent mental rapport, and you enjoy one another’s intelligence, wit, and style. Both of you are very social creatures who thrive on interaction with people, cultural activities and conversation. They might hit roadblocks from time to time, with the indecisive and people-pleasing Libra friend and the inconsistent and flaky Gemini friend. However, it’s nothing they can’t work through together."
    },
    {
        "sign": "leo",
        "compatability": "Fire(Leo)-Air(Aquarius) connection. Leo and Aquarius sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract! Aquarius is drawn to Leo’s warmth and vitality, and Leo is drawn to Aquarius’s uniqueness, intelligence, and savvy. There are significant differences between you though. Aquarius’s colleagues, associates, and large social circle of friends and acquaintances are a very important part of Aquarius’s life, while Aquarius’s need for close, personal relationships is not as great as Leo’s. This characteristic is also reflected in your relationship! Aquarius may seem cool and aloof to Leo. From Aquarius’s perspective, Leo takes life too personally and seems to dramatize events, idolize individuals, and, in general, be too self-absorbed. You are truly opposites in many ways and can certainly benefit from one another’s attitudes and insights. \n Fire(Leo)-Air(Gemini) connection. You both have a very childlike, playful, fun-loving side that is brought out when you are together. You both love drama and color, and you find one another to be delightful and interesting. Their differences also complement each other well. Confident Leos help indecisive Geminis, and intelligent Geminis can steady naive Leos. \n Fire(Leo)-Fire(Sagittarius) connection. Warmth, enthusiasm, vitality, and joy are kindled when the two of you are together, and there is great magnetism between you. Sagittarius draws Leo out, evoking the more light-hearted, fun-loving side of Leo. Sagittarius also keeps Leo from getting stuck in a rut, introducing new ideas and experiences that Leo enjoys. This is a mutually beneficial relationship which promises lots of good times and a very active life together."
    },
    {
        "sign": "capricorn",
        "compatability": "Earth(Capricorn)-Water(Cancer) connection. Capricorn and Cancer sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract! Your differences can serve to complement each other if you really understand and appreciate each other. A Cancer and Capricorn friendship is quite strong and balanced. Capricorns like to plan things out and Cancers aren’t too picky when it comes to activities. Compromise is easy for them. They will create a secure, lifelong bond. These signs will be able to tell one another anything. They won’t judge each other. These signs will support each other through everything. \n Earth(Capricorn)-Water(Pisces) connection. Capricorns are logical and rational, and like to work hard to achieve their dreams. Pisces are imaginative and spiritual, and always consider the likes and dislikes of people around them. Nevertheless, the star signs form a deep and sincere relationship. Capricorn admires Pisces’ varying and considerate nature, and Pisces admire Capricorn’s practicality and resolve. The friendship between Capricorn and Pisces gets stronger over time. Capricorn and Pisces form a great team, and complement each other very well. \n Earth(Capricorn)-Earth(Virgo) connection. Your energies blend together well, and you can be a very effective team in business affairs and practical undertakings. Virgo and Capricorn are both logical and intelligent, and both want a lot from life. Virgo admires Capricorn’s devotion and perseverance, and Capricorn admires Virgo’s logical and selective nature. They form a strong, deep relationship with neither sign having any delusions about the other."
    },
    {
        "sign": "sagittarius",
        "compatability": "Fire(Sagittarius)-Air(Gemini) connection. Gemini and Sagittarius sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract! You often see things from a different perspective, but usually you can benefit from each other’s viewpoint and you are adaptable and flexible enough to listen to each other and benefit from each other. Both of you are curious individuals, rather restless and on-the-go. You can expect your lives together to be very active, with lots of changes, probably frequent moves, adjustments, surprises, and new challenges. These changes will bring lots of ups and downs, but overall both of you will be greatly enriched by these diverse activities and interests. \n Fire(Sagittarius)-Air(Libra) connection. Both of you are outgoing, friendly people. You enjoy socializing and you enjoy each other’s company immensely. Very often Sagittarius provides extra “zing” to the relationship with lots of grandiose ideas, dreams, visions, and restless wanderlust. Libra helps provide a more balanced, sensible perspective while usually being sympathetic to Sagittarius as well. \n Fire(Sagittarius)-Fire(Aries) connection. Enthusiasm, a sense of adventure, and high spirited play infuse your relationship. You both feel you can be yourselves fully with one another: you don’t have to tone down any of your exuberance and energy, the way you might with someone else. In fact, you inspire and vitalize one another’s strength. Aries sometimes clashes or competes with other strong individuals, but Sagittarius is tolerant, not threatened, and doesn’t take the bait. Also, you both need personal freedom and space, and even if you spend all of your time together, you are unlikely to feel smothered in this relationship. A happy twosome!"
    },
    {
        "sign": "pisces",
        "compatability": "Water(Scorpio)-Earth(Virgo) connection. Pisces and Virgo sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract! Your differences do not necessarily conflict with each other and there is a good possibility that you will appreciate and understand each other sufficiently to harmonize well. Thus the partners balance each other wonderfully, and provide for each other’s deficiencies. Virgo and Pisces form a plain and simple pair, devoting themselves to each other and to their other friends. Both signs bring out the good qualities in each other, and form a lasting friendship. \n Water(Scorpio)-Earth(Capricorn) connection. Capricorns are logical and rational, and like to work hard to achieve their dreams. Pisces are imaginative and spiritual, and always consider the likes and dislikes of people around them. Nevertheless, the star signs form a deep and sincere relationship. Capricorn admires Pisces’ varying and considerate nature, and Pisces admire Capricorn’s practicality and resolve. The friendship between Capricorn and Pisces gets stronger over time. Capricorn and Pisces form a great team, and complement each other very well. \n Water(Scorpio)-Water(Scorpio) connection. Both of you are very sensitive, feeling, compassionate people, and with one another you are able to have a depth of sharing and intimacy and emotional union that you will find with few others. Pisces’s sympathetic, non-judgmental, understanding attitude can be a healing balm to Scorpio, who is more emotional and who often carries secret guilt, inner conflicts, and pain."
    },
    {
        "sign": "aries",
        "compatability": "Libra Fire(Aries)-Air(Libra) connection. Aries and Libra sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract! While these two signs have opposing rulers, they actually have complementary elements. Fire and air signs tend to do really well together, since fire needs air in order to survive. This makes both Aries and Libra the life of the party — Libra's the one throwing it, of course, and Aries is the star of the show. \n Fire(Aries)-Fire(Leo) connection. Both signs are dynamic and adventurous, and there is always a healthy competitive spirit between them. They always drive each other onto bigger and better things, and there is never a dull moment in their partnership. Both signs want to be the one to lead, and their strong egos could give rise to tense moments. The pair respects and admires each other, but they should also learn to yield to each other occasionally for things to run smoothly. \n Fire(Aries)-Air(Aquarius) connection. Both of you are independent, active individuals who appreciate progressive, dynamic approaches to any situation or problem, and your relationship has a lively, spirited quality. You both can be iconoclasts as well, taking pride in your freedom from many traditional values and beliefs. Aries Is more concerned with personal creativity and, in some ways, less integrated into social groups and the community than Aquarius. You do appreciate and respect one another’s uniqueness and individuality."
    },
    {
        "sign": "aquarius",
        "compatability": "Air(Aquarius)-Fire(Leo) connection. Aquarius and Leo sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract! Aquarius is drawn to Leo’s warmth and vitality, and Leo is drawn to Aquarius’s uniqueness, intelligence, and savvy. There are significant differences between you though. Aquarius’s colleagues, associates, and large social circle of friends and acquaintances are a very important part of Aquarius’s life, while Aquarius’s need for close, personal relationships is not as great as Leo’s. This characteristic is also reflected in your relationship! Aquarius may seem cool and aloof to Leo. From Aquarius’s perspective, Leo takes life too personally and seems to dramatize events, idolize individuals, and, in general, be too self-absorbed. You are truly opposites in many ways and can certainly benefit from one another’s attitudes and insights. \n Air(Aquarius)-Fire(Aries) connection. Both of you are independent, active individuals who appreciate progressive, dynamic approaches to any situation or problem, and your relationship has a lively, spirited quality. You both can be iconoclasts as well, taking pride in your freedom from many traditional values and beliefs. Aries Is more concerned with personal creativity and, in some ways, less integrated into social groups and the community than Aquarius. You do appreciate and respect one another’s uniqueness and individuality. \n Air(Aquarius)-Air(Gemini) connection. Although you are different people, you might find that your basic goals and outlook in life are compatible. You have an excellent intellectual rapport. You spark each other’s wit and you love to toss ideas back and forth. Intellectual companionship is important to both of you, and in this relationship you have found a partner whose conversation and company you enjoy. Shared viewpoints, common interests, and social activities are key elements in your relationship."
    },
    {
        "sign": "virgo",
        "compatability": "Earth(Virgo)-Water(Pisces) connection. Virgo and Pisces sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract! Your differences do not necessarily conflict with each other and there is a good possibility that you will appreciate and understand each other sufficiently to harmonize well. Thus the partners balance each other wonderfully, and provide for each other’s deficiencies. Virgo and Pisces form a plain and simple pair, devoting themselves to each other and to their other friends. Both signs bring out the good qualities in each other, and form a lasting friendship. \n Earth(Virgo)-Water(Scorpio) connection. Virgo and Scorpio understand each other well, and converse well with each other. They share a strong, faithful bond with each other. The two signs prefer to spend time with each other, rather than with a lot of friends. Virgo and Scorpio are after fame and fortune. Both signs want worldly possessions and social status. They are both reliable, inclined to service, and helpful to their friends. Virgo are quiet and reticent, and Scorpio are more obscure. Because of their differences, both signs need to make compromises to each other. \n Earth(Virgo)-Earth(Capricorn) connection. Both of you are very practical, well-grounded people. You are responsible, trustworthy, and mature as well. Your energies blend together well, and you can be a very effective team in business affairs and practical undertakings. Virgo and Capricorn are both logical and intelligent, and both want a lot from life. Virgo admires Capricorn’s devotion and perseverance, and Capricorn admires Virgo’s logical and selective nature. They form a strong, deep relationship with neither sign having any delusions about the other."
    },
    {
        "sign": "scorpio",
        "compatability": "Water(Scorpio)-Earth(Taurus) connection. Scorpio and Taurus sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract!  It's believed that opposing signs of the zodiac have certain, similar qualities that make them a strong match. Scorpios are deep and mysterious and will inspire their Taurus partner with their ways, while Taurus is very practical and straightforward and will influence their Scorpio partner the same way. \n Water(Scorpio)-Earth(Capricorn) connection. Capricorn's and Scorpio's energies blend together naturally. Scorpio and Capricorn compatibility is very driven, especially when it comes to accomplishing projects. When these two signs form a friendship, it may be turbulent at first, due to their stubborn personalities. Once they learn to respect each other, however, it is the kind of friendship that will result in a powerful and long lasting connection. \n Water(Scorpio)-Water(Pisces) connection. Both of you are very sensitive, feeling, compassionate people, and with one another you are able to have a depth of sharing and intimacy and emotional union that you will find with few others. Pisces’s sympathetic, non-judgmental, understanding attitude can be a healing balm to Scorpio, who is more emotional and who often carries secret guilt, inner conflicts, and pain."
    },
    {
        "sign": "gemini",
        "compatability": "Air(Gemini)-Fire(Sagittarius) connection. Gemini and Sagittarius sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract! You often see things from a different perspective, but usually you can benefit from each other’s viewpoint and you are adaptable and flexible enough to listen to each other and benefit from each other. Both of you are curious individuals, rather restless and on-the-go. You can expect your lives together to be very active, with lots of changes, probably frequent moves, adjustments, surprises, and new challenges. These changes will bring lots of ups and downs, but overall both of you will be greatly enriched by these diverse activities and interests. \n Air(Gemini)-Fire(Aries) connection. From the first time they meet, they'll immediately get along. Both signs are positive, energetic, and outgoing. They both love trying new things and may even find themselves getting into some trouble together. \n Air(Gemini)-Air(Libra) connection. You have an excellent mental rapport, and you enjoy one another’s intelligence, wit, and style. Both of you are very social creatures who thrive on interaction with people, cultural activities and conversation. They might hit roadblocks from time to time, with the indecisive and people-pleasing Libra friend and the inconsistent and flaky Gemini friend. However, it’s nothing they can’t work through together."
    },
    {
        "sign": "taurus",
        "compatability": "Earth(Taurus)-Water(Scorpio) connection. Taurus and Scoprio sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract! It's believed that opposing signs of the zodiac have certain, similar qualities that make them a strong match. Scorpios are deep and mysterious and will inspire their Taurus partner with their ways, while Taurus is very practical and straightforward and will influence their Scorpio partner the same way. \n Earth(Taurus)-Earth(Capricorn) connection. Both of you are very practical people, with good common sense. Your grounded and realistic approach to issues makes you very compatible philosophically and intellectually. Over time, the two of you may become too complacent and conservative, and focus too much on mundane affairs or narrowly focused mental interests. Take time for sheer fun and enjoyment and do not become too serious. You feel you can rely on one another. You can also accomplish a lot together: Capricorn is a good organizer and strategist and Taurus will follow through with any joint plan. You make a good team. \n Earth(Taurus)-Water(Cancer) connection. Both of you are very domestic and appreciate the simple joys of life. Others find the two of you to be very warm, friendly, and caring, and your soft and considerate attitude is greatly appreciated by your friends. Cancer is very emotional, very attached to family and familiar surroundings and easily upset by any form of cruelty; Taurus’ practical, grounded approach to life and gentle manner is very much appreciated by Cancer."
    }

]
