[
    {
        "sign": "cancer",
        "compatability": "Water(Cancer)-Earth(Capricorn) connection. Cancer and Capricorn sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract! Your differences can serve to complement each other if you really understand and appreciate each other. A Cancer and Capricorn friendship is quite strong and balanced. Capricorns like to plan things out and Cancers aren’t too picky when it comes to activities. Compromise is easy for them. They will create a secure, lifelong bond. These signs will be able to tell one another anything. They won’t judge each other. These signs will support each other through everything."
    },
    {
        "sign": "libra",
        "compatability": "Air(Libra)-Fire(Aries) connection. Libra and Aries sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract! While these two signs have opposing rulers, they actually have complementary elements. Fire and air signs tend to do really well together, since fire needs air in order to survive. This makes both Aries and Libra the life of the party — Libra's the one throwing it, of course, and Aries is the star of the show."
    },
    {
        "sign": "leo",
        "compatability": "Fire(Leo)-Air(Aquarius) connection. Leo and Aquarius sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract! Aquarius is drawn to Leo’s warmth and vitality, and Leo is drawn to Aquarius’s uniqueness, intelligence, and savvy. There are significant differences between you though. Aquarius’s colleagues, associates, and large social circle of friends and acquaintances are a very important part of Aquarius’s life, while Aquarius’s need for close, personal relationships is not as great as Leo’s. This characteristic is also reflected in your relationship! Aquarius may seem cool and aloof to Leo. From Aquarius’s perspective, Leo takes life too personally and seems to dramatize events, idolize individuals, and, in general, be too self-absorbed. You are truly opposites in many ways and can certainly benefit from one another’s attitudes and insights."
    },
    {
        "sign": "capricorn",
        "compatability": "Earth(Capricorn)-Water(Cancer) connection. Capricorn and Cancer sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract! Your differences can serve to complement each other if you really understand and appreciate each other. A Cancer and Capricorn friendship is quite strong and balanced. Capricorns like to plan things out and Cancers aren’t too picky when it comes to activities. Compromise is easy for them. They will create a secure, lifelong bond. These signs will be able to tell one another anything. They won’t judge each other. These signs will support each other through everything."
    },
    {
        "sign": "sagittarius",
        "compatability": "Fire(Sagittarius)-Air(Gemini) connection. Gemini and Sagittarius sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract! You often see things from a different perspective, but usually you can benefit from each other’s viewpoint and you are adaptable and flexible enough to listen to each other and benefit from each other. Both of you are curious individuals, rather restless and on-the-go. You can expect your lives together to be very active, with lots of changes, probably frequent moves, adjustments, surprises, and new challenges. These changes will bring lots of ups and downs, but overall both of you will be greatly enriched by these diverse activities and interests."
    },
    {
        "sign": "pisces",
        "compatability": "Water(Scorpio)-Earth(Virgo) connection. Pisces and Virgo sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract! Your differences do not necessarily conflict with each other and there is a good possibility that you will appreciate and understand each other sufficiently to harmonize well. Thus the partners balance each other wonderfully, and provide for each other’s deficiencies. Virgo and Pisces form a plain and simple pair, devoting themselves to each other and to their other friends. Both signs bring out the good qualities in each other, and form a lasting friendship."
    },
    {
        "sign": "aries",
        "compatability": "Libra Fire(Aries)-Air(Libra) connection. Aries and Libra sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract! While these two signs have opposing rulers, they actually have complementary elements. Fire and air signs tend to do really well together, since fire needs air in order to survive. This makes both Aries and Libra the life of the party — Libra's the one throwing it, of course, and Aries is the star of the show."
    },
    {
        "sign": "aquarius",
        "compatability": "Air(Aquarius)-Fire(Leo) connection. Aquarius and Leo sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract! Aquarius is drawn to Leo’s warmth and vitality, and Leo is drawn to Aquarius’s uniqueness, intelligence, and savvy. There are significant differences between you though. Aquarius’s colleagues, associates, and large social circle of friends and acquaintances are a very important part of Aquarius’s life, while Aquarius’s need for close, personal relationships is not as great as Leo’s. This characteristic is also reflected in your relationship! Aquarius may seem cool and aloof to Leo. From Aquarius’s perspective, Leo takes life too personally and seems to dramatize events, idolize individuals, and, in general, be too self-absorbed. You are truly opposites in many ways and can certainly benefit from one another’s attitudes and insights."
    },
    {
        "sign": "virgo",
        "compatability": "Earth(Virgo)-Water(Pisces) connection. Virgo and Pisces sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract! Your differences do not necessarily conflict with each other and there is a good possibility that you will appreciate and understand each other sufficiently to harmonize well. Thus the partners balance each other wonderfully, and provide for each other’s deficiencies. Virgo and Pisces form a plain and simple pair, devoting themselves to each other and to their other friends. Both signs bring out the good qualities in each other, and form a lasting friendship."
    },
    {
        "sign": "scorpio",
        "compatability": "Water(Scorpio)-Earth(Taurus) connection. Scorpio and Taurus sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract!  It's believed that opposing signs of the zodiac have certain, similar qualities that make them a strong match. Scorpios are deep and mysterious and will inspire their Taurus partner with their ways, while Taurus is very practical and straightforward and will influence their Scorpio partner the same way."
    },
    {
        "sign": "gemini",
        "compatability": "Air(Gemini)-Fire(Sagittarius) connection. Gemini and Sagittarius sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract! You often see things from a different perspective, but usually you can benefit from each other’s viewpoint and you are adaptable and flexible enough to listen to each other and benefit from each other. Both of you are curious individuals, rather restless and on-the-go. You can expect your lives together to be very active, with lots of changes, probably frequent moves, adjustments, surprises, and new challenges. These changes will bring lots of ups and downs, but overall both of you will be greatly enriched by these diverse activities and interests."
    },
    {
        "sign": "taurus",
        "compatability": "Earth(Taurus)-Water(Scorpio) connection. Taurus and Scoprio sit on opposing signs of the zodiac sign, making them true opposites, however, opposites attract! It's believed that opposing signs of the zodiac have certain, similar qualities that make them a strong match. Scorpios are deep and mysterious and will inspire their Taurus partner with their ways, while Taurus is very practical and straightforward and will influence their Scorpio partner the same way."
    }

]
